## Terraform Plan - PROD 🔴

#### Formato: ``
#### Init: ``
#### Validate: ``
#### Plan: `success`

<details><summary>Ver Plan Completo</summary>

```terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.app_bucket.google_storage_bucket.this will be created
  + resource "google_storage_bucket" "this" {
      + effective_labels            = {
          + "environment" = "prod"
          + "managed_by"  = "terraform"
          + "team"        = "platform"
        }
      + force_destroy               = false
      + id                          = (known after apply)
      + labels                      = {
          + "environment" = "prod"
          + "managed_by"  = "terraform"
          + "team"        = "platform"
        }
      + location                    = "US-CENTRAL1"
      + name                        = "prueba-tf-pdn-app-data-prod"
      + project                     = "prueba-tf-pdn"
      + project_number              = (known after apply)
      + public_access_prevention    = (known after apply)
      + rpo                         = (known after apply)
      + self_link                   = (known after apply)
      + storage_class               = "STANDARD"
      + terraform_labels            = {
          + "environment" = "prod"
          + "managed_by"  = "terraform"
          + "team"        = "platform"
        }
      + uniform_bucket_level_access = true
      + url                         = (known after apply)

      + versioning {
          + enabled = true
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + app_bucket_name = "prueba-tf-pdn-app-data-prod"
  + app_bucket_url  = (known after apply)

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "tfplan"

```

</details>

*Pusheado por: @jorgepinilla-glctn, Acción: `pull_request`*